Revit 2026 API

# IndependentTagCanLeaderEndConditionBeAssigned Method

---

Checks whether the LeaderEndCondition can be changed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanLeaderEndConditionBeAssigned(
	LeaderEndCondition leaderEndCondition
)
```
```vb
Public Function CanLeaderEndConditionBeAssigned (
	leaderEndCondition As LeaderEndCondition
) As Boolean
```
```cpp
public:
bool CanLeaderEndConditionBeAssigned(
	LeaderEndCondition leaderEndCondition
)
```
```fsharp
member CanLeaderEndConditionBeAssigned :
        leaderEndCondition : LeaderEndCondition -> bool
```

#### Parameters

leaderEndCondition LeaderEndCondition
     The leader end condition to check.

#### Return Value

Boolean True if the leader end condition of the tag can be assigned, or false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Material tags and material keynotes can only use the free end condition.

#### Reference

IndependentTag Class

Autodesk.Revit.DB Namespace